In [105]:
import pandas as pd
import numpy as np

In [106]:
df=pd.DataFrame({'id':np.random.randint(1,2000,10),'age':np.random.randint(1,100,10)})

# 1. SELECT * FROM data;

In [107]:
df

     id  age
0   824   73
1  1209   94
2  1713   23
3   119   71
4   445   51
5  1223   63
6  1249   69
7  1165   30
8  1503   70
9  1441   72

# 2. SELECT * FROM data LIMIT 10;

In [108]:
df.head(10)

     id  age
0   824   73
1  1209   94
2  1713   23
3   119   71
4   445   51
5  1223   63
6  1249   69
7  1165   30
8  1503   70
9  1441   72

# 3. SELECT id FROM data;  //id 是 data 表的特定一列

In [109]:
df['id']

0     824
1    1209
2    1713
3     119
4     445
5    1223
6    1249
7    1165
8    1503
9    1441
Name: id, dtype: int32

# 4. SELECT COUNT(id) FROM data;

In [110]:
df['id'].count()

10

# 5. SELECT * FROM data WHERE id<1000 AND age>30;

In [111]:
df[(df['id']<1000)&(df['age']>30)]

    id  age
0  824   73
3  119   71
4  445   51

# 6. SELECT id,COUNT(DISTINCT order_id) FROM table1 GROUP BY id;

In [112]:
import random
df1=pd.DataFrame({'id':[random.choice([1,2,10]) for _ in range(5)],'orderid':random.sample(range(5),5)})
df2=pd.DataFrame({'id':[random.choice([1,2,10]) for _ in range(5)],'orderid':random.sample(range(5),5)})

In [113]:
df1

   id  orderid
0   2        1
1   1        4
2   1        3
3  10        2
4   1        0

In [114]:
df2

   id  orderid
0  10        3
1   2        4
2   1        2
3  10        1
4   1        0

In [115]:
#写法1
df1.groupby('id')['orderid'].count()

id
1     3
2     1
10    1
Name: orderid, dtype: int64

In [116]:
#写法2
df1.groupby('id').agg({'orderid':'nunique'})

    orderid
id
1         3
2         1
10        1

# 7. SELECT * FROM table1 t1 INNER JOIN table2 t2 ON t1.id = t2.id;

In [117]:
pd.merge(df1,df2,on='id')

   id  orderid_x  orderid_y
0   2          1          4
1   1          4          2
2   1          4          0
3   1          3          2
4   1          3          0
5   1          0          2
6   1          0          0
7  10          2          3
8  10          2          1

# 8. SELECT * FROM table1 UNION SELECT * FROM table2;

In [118]:
pd.concat([df1,df2])

   id  orderid
0   2        1
1   1        4
2   1        3
3  10        2
4   1        0
0  10        3
1   2        4
2   1        2
3  10        1
4   1        0

# 9. DELETE FROM table1 WHERE id=10;

In [119]:
df1.drop(df1[df1['id']==10].index,inplace=True)
df1

   id  orderid
0   2        1
1   1        4
2   1        3
4   1        0

# 10. ALTER TABLE table1 DROP COLUMN column_name;

In [120]:
#写法1
del df1['orderid']
df1

   id
0   2
1   1
2   1
4   1

In [121]:
#写法2
df2.drop('orderid',axis=1)

   id
0  10
1   2
2   1
3  10
4   1

In [122]:
#写法3
df2.drop(columns='id')

   orderid
0        3
1        4
2        2
3        1
4        0